$(document).ready(function () {

function getQuote() {


	var quotes=["Κάποτε μας ωφελούν περισσότερο οι εχθροί με τις κατηγορίες, παρά οι φίλοι με τους επαίνους, διότι οι μεν εχθροί, φανερώνουν, οι δε φίλοι, κρύβουν τα ελαττώματά μας.",
	"Πιο σίγουρο είναι να εμπιστεύεται κανείς τον άνεμο, που κινείται ακατάπαυστα, πιο σίγουρο είναι να εμπιστεύεται όσα χαράζουν τα παιδιά πάνω στην άμμο, όταν παίζουν, παρά την ανθρώπινη ευτυχία.",
	"Να θυμάσαι πάντοτε, ότι το σήμερα είναι δικό σου, το αύριο είναι στο χέρι του Θεού. Και Εκείνος που σου έδωσε το πρωί, δεν σου υπόσχεται και το βράδυ.",
	"Στην Προσευχή μας , να νοιώθουμε σαν το παιδάκι στην αγκαλιά της μάνας του!","Απόφευγε να μιλάς αυστηρά και μεγαλόφωνα. Διότι και τα δύο είναι πολύ μισητά και δίνουν υποψία, πως είσαι μάταιος και έχεις μεγάλη υπόληψη για τον εαυτό σου.",
	"Μη περιμένεις την ημέρα του θανάτου σου για να μάθεις την αδυναμία σου. Διερεύνησε τον εαυτό σου όσο ακόμα ζει, προχώρησε με τη σκέψη σου στο εσωτερικό του και τότε θα δεις όλη τη μηδαμινότητά του.",
	"Ο Θεός δεν βλέπει στο πρόσωπο, ούτε στην εξωτερική μόνο εμφάνιση των ηθών, ούτε στις κραυγές μας, αδελφοί, αλλά στην συντριμμένη και ταπεινωμένη καρδιά.",
	"Η αγάπη της ατομικής φύσης μας είναι πολύ λεπτή και γι΄ αυτό σε λίγους γνωστή. Αυτή, λοιπόν, ζητάει κρυφά τα του εαυτού της και εμείς νομίζουμε ότι αρέσουν στον Θεό, η αλήθεια όμως δεν είναι έτσι.",
	" Τη σιωπή να την αγαπάς περισσότερο από το λόγο, γιατί η σιωπή φέρνει θησαυρό, ενώ η ομιλία τον διασκορπίζει.",
	"Δεν υπάρχει καμία κακία που να μη διαλύεται με τα σωτήρια δάκρυα της μετάνοιας.","Γνώριζε ότι χωρίς πειρασμούς βρίσκεσαι μακριά από το δρόμο του Θεού και δεν περπατάς στα ίχνη των αγίων",
	];
	var author =["-Άγνωστος Ασκητής","-Αγιος Γρηγοριος Θεολογος"
,"-Αγιος Νικοδημος Αγιορειτης","-Πάτερ Παίσιος","-Αγιος Νικοδημος Αγιορειτης",
"-Αγιος Ιωάννης ο Χρυσόστομος","-Οσιος Συμεων Νεος Θεολογος","-Αγιος Νικοδημος Αγιορειτης","-Άγνωστος Ασκητής",
"-Όσιος Νείλος","-Ισαακ ο Σύρος"


];
var randomNum = Math.floor((Math.random()*quotes.length));
var randomQuote =quotes[randomNum];
var randomAuthor =author[randomNum];
$(".quote").text(randomQuote);
$(".author").text(randomAuthor);

}
//$(".btn").on("click",function(){ getQuote();});

var myColors = '#'+(Math.random()*0xFFFFFF<<0).toString(16);
function clickMe(){
  var randomize =  myColors[Math.floor(Math.random()*myColors.length)];
   
  $(".container").css("background-color", myColors[randomize]);		
  

$(".h1").css("color", myColors[randomize]);
$(".quote").css("color", myColors[randomize]);
$(".author").css("color", myColors[randomize]);		
$(".btn").css("background-color", myColors[randomize]);

}
$(".btn").on("click",function(){ getQuote();
var randomColorChange = '#'+(Math.random()*0xFFFFFF<<0).toString(16);
$("h1").css("color", randomColorChange);
$('.container').css('background-color', randomColorChange);
$(".quote").css("color", randomColorChange);
$(".author").css("color", randomColorChange);		
$(".btn").css("background-color", randomColorChange);
 

   });

});